<a href="https://colab.research.google.com/github/sajid-munawar/Pandas-a-versatile-and-high-performance-Python-library-for-data-manipulation-analysis-and-discover/blob/main/Getting_Perticular_Row.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({"Student Name":[1,2,3,4,5],'Year':[2001,2002,2003,2004,2005],'Grades':['A','B','C','D','E']})
df

   Student Name  Year Grades
0             1  2001      A
1             2  2002      B
2             3  2003      C
3             4  2004      D
4             5  2005      E

In [7]:
df['Year']

0    2001
1    2002
2    2003
3    2004
4    2005
Name: Year, dtype: int64

In [11]:
df[df['Year']==2002]

   Student Name  Year Grades
1             2  2002      B

In [12]:
df["Year"]==2002

0    False
1     True
2    False
3    False
4    False
Name: Year, dtype: bool

In [15]:
df.iloc[1]

Student Name       2
Year            2002
Grades             B
Name: 1, dtype: object

In [22]:
df[df['Student Name']==2]

   Student Name  Year Grades
1             2  2002      B